<template>
  <div class="wrapper">
    <el-row :gutter="10" type="flex" justify="center">
      <el-col :xs="20" :sm="16" :md="12" :lg="12" :xl="12">
        <h2>Маааакс! С ДНЕМ РОЖДЕНИЯ!!!</h2>
        <p>Здесь должна быть открытка, но я тебе ее скину в вотсаппе</p>
        <p>Еще здесь должна быть песня, но я ее тебе прокричу в трубку телефона (надеюсь ты уже купил айфон)</p>
        <p>Также здесь должен быть танец, но его я станцую при встрече</p>
        <p>А пока... Предлагаю тебе сыграть в игру.</p>
        <p>Этот квест был составлен специально для тебя в твой день, но идею я конечно сперла у Бегущего города))))</p>
        <p>Но ты хозяин этого праздника и можешь выбрать любой день для прохождения, чтобы было максимально комфортно. Также ты можешь разделить этот квест на несколько дней, но начинать тебе нужно все равно с точки, где ты остановился.</p>
        <p>Этапов всего 18 - прекрасная цифра и возраст мог бы быть твоим, если бы тебе не исполнилось сегодня 31 :D Начальная точка - твой дом. Если задание - сделать фото, то присылай мне фото в телеграмм, а для прохода дальше я буду тебе давать секретный ключ. В конце прекрасный подарок, я старалась ;)</p>
        <p>Я очень надеюсь, что ты не будешь гуглить, а будешь честно проходить все этапы, я верю в тебя, что ты все отгадаешь!</p>
        <h3>Впереееед!!!</h3>
        <p>P.S. Не суди строго)</p>
        <el-button type="success" @click="onClick">Начать квест</el-button>
      </el-col>
    </el-row>
  </div>
</template>

<script>
import {setAppStoreItem} from "../lib/appStore";

export default {
  name: "happy-birthday",
  methods: {
    onClick() {
      setAppStoreItem('happyBirthday', true)
      this.$router.push(this.$route.meta.nextStep)
    }
  }
}
</script>

<style scoped>
.wrapper {
  padding: 40px 0;
  background-color: #FAEDD7;
  width: 100vw;
  height: 100vh;
}
</style>