<template>
  <div>
    <Step
        title="2. Мечтам свойственно сбываться"
        image="https://cdn-07.pronovostroy.ru/object/2018-06-04/5b1543b293c0a51759ff0395/images/5b154433a1782.jpeg"
        @check="checkAnswer"
    >
      <p>Найди район от слова, которое с XIV века обозначало льняное полотно, и по совместительству район, где ты бы хотел жить.</p>
      <p>Предлагаю прогуляться неспешным шагом по району и представить, как ты уже живешь в этом районе, заходишь в кофейню у дома за стаканчиком бодрящего. Ну а чего?! Мысли же материализуются!!! Почему бы не попробовать ;))) </p>
      <p>На самом деле я уже представила это и даже нашла место, где ты будешь сжигать все, что мы наедим в KFC :D Ты же теперь неугомонный спортсмен :D</p>
      <p>Вспоминая Бегущий город, неподалеку от рынка есть сквер, найди здание с названием большой морской птицы. Пришли селфи, ну и можешь ознакомиться с прайсом - тебе же здесь жить.</p>
    </Step>
  </div>
</template>

<script>
import Step from '../../components/step';
import StepMixin from '../../components/step-mixin'
export default {
  name: "first-step",
  data() {
    return {
      valueTrue: '7352',
      number: 2
    }
  },
  components: {
    Step
  },
  mixins: [
    StepMixin
  ]
}
</script>

<style scoped>

</style>