<template>
  <div>
    <Step
        title="14. Время загадать желание"
        image="https://img07.rl0.ru/afisha/e1200x600i/daily.afisha.ru/uploads/images/9/26/926003b007b240358d113080818d8fd1.jpg"
        @check="checkAnswer"
    >
      <p>Поздравляю! Ты нашел дом Булгакова!</p>
      <p>За многие годы на Большой Садовой образовалась традиция оставлять в доме на стенах или в записках свои пожелания и мечты,
        поэтому ещё в 2004 году в культурном центре «Булгаковский дом» был установлен ящик «Почта любви», куда посетители опускают записки с желаниями.
        Ящик быстро переполнялся записками, которые регулярно вынимались и складывались на хранение.
        С 2007 г. летом ежегодно во дворе Булгаковского дома проходит акция «День исполнения желаний»,
        когда все накопившиеся за год записки привязываются к воздушным шарам и одновременно запускаются к небу.</p>
      <p>Можешь искать этот волшебный ящик, а можешь не искать :D Но предлагаю тебе подумать о своих желаниях и мечтах, представить, что они сбываются.</p>
      <p>По желанию можешь сходить в музей, мне потом расскажешь))))</p>
      <p>Но сфотографироваться с Коровьевым и Бегемотом просто не обходимо! С тебя селфи в телеграмме - с мея ключ к следующему шагу)</p>
    </Step>
  </div>
</template>

<script>
import Step from '../../components/step';
import StepMixin from '../../components/step-mixin'
export default {
  name: "step-2",
  data() {
    return {
      valueTrue: '8457',
      number: 14
    }
  },
  components: {
    Step
  },
  mixins: [
    StepMixin
  ]
}
</script>

<style scoped>

</style>