<template>
  <div>
    <Step
        title="12. Как молод ты был"
        image="https://lekoboz.ru/images/2018/18.03/499569310790.jpg"
        @check="checkAnswer"
    >
      <p>Наверное, ты знаешь, что эти вывески - история, спасенная руками москвичей. О старинных деталях в городе заботится команда неравнодушных горожан «Вспомнить всё».
        За несколько лет она разыскала и отреставрировала семь вывесок 1910—1920-х годов, рекламную «визитку» на фасаде дома, исторический тротуарный люк, кирпичное клеймо и световые окна-люксферы.</p>
      <p>А тебе я хочу напомнить, чтобы ты не забывал, что тебе 31 и ты уже не так молод :D Желаю как можно реже посещать подобные заведения с такой вывеской.</p>
      <p>Но! Раз ты тут, сделай селфи на фоне квартиры №6 и получишь код, который тебя приблизит к подарку ;) </p>
    </Step>
  </div>
</template>

<script>
import Step from '../../components/step';
import StepMixin from '../../components/step-mixin'
export default {
  name: "first-step",
  data() {
    return {
      valueTrue: '6919',
      number: 12
    }
  },
  components: {
    Step
  },
  mixins: [
    StepMixin
  ]
}
</script>

<style scoped>

</style>